# InPlaceFamilyNotCuttingHost Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..InfillFailures..::..InPlaceFamilyNotCuttingHost Property
BuiltInFailures..::..InfillFailures Class See Also
---
Instance of in-place family is not cutting host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InPlaceFamilyNotCuttingHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InPlaceFamilyNotCuttingHost As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InPlaceFamilyNotCuttingHost {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..InfillFailures Class
Autodesk.Revit.DB Namespace